# First Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexPair..::..First Property
VertexPair Class See Also
---
Identifies the first index of VertexPair.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public int First { get; set; }
```

Visual Basic
---
```text
Public Property First As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int First {
	int get ();
	void set (int value);
}
```

# See Also
VertexPair Class
Autodesk.Revit.DB Namespace